RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_adc.c
            tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_NEG_SATUR_CLR);
            BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);

            /*Manual reset*/
            tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_ISR);
            tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_NEG_SATUR_CLR);
            BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);

            break;

        case ADC_INT_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            /*Manual reset*/
            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            break;

        case ADC_INT_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_OVERRUN_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_OVERRUN_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            /*Manual reset*/
            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_OVERRUN_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            break;

        case ADC_INT_ADC_READY:
            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_RDY_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_RDY_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            /*Manual reset*/
            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_RDY_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            break;

        case ADC_INT_ALL:
            tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_ISR);
            tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_POS_SATUR_CLR);
            tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_NEG_SATUR_CLR);
            BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);

            tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_POS_SATUR_CLR);
            tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_NEG_SATUR_CLR);
            BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);

            /*Manual reset*/
            tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_ISR);
            tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_POS_SATUR_CLR);
            tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_NEG_SATUR_CLR);
            BL_WR_REG(AON_BASE, AON_GPADC_REG_ISR, tmpVal);

            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_CLR);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_OVERRUN_CLR);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_RDY_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_CLR);
            tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_FIFO_OVERRUN_CLR);
            tmpVal = BL_SET_REG_BIT(tmpVal, GPIP_GPADC_RDY_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            /*Manual reset*/
            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_UNDERRUN_CLR);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_FIFO_OVERRUN_CLR);
            tmpVal = BL_CLR_REG_BIT(tmpVal, GPIP_GPADC_RDY_CLR);
            BL_WR_REG(GPIP_BASE, GPIP_GPADC_CONFIG, tmpVal);

            break;

        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  ADC get interrupt status
 *
 * @param  intType: interrupt type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type ADC_GetIntStatus(ADC_INT_Type intType)
{
    uint32_t tmpVal;
    BL_Sts_Type bitStatus = RESET;

    /* Check the parameters */
    CHECK_PARAM(IS_GPIP_ADC_INT_TYPE(intType));

    switch (intType) {
        case ADC_INT_POS_SATURATION:
            tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_ISR);
            bitStatus = (BL_IS_REG_BIT_SET(tmpVal, AON_GPADC_POS_SATUR)) ? SET : RESET;
            break;

        case ADC_INT_NEG_SATURATION:
            tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_ISR);
            bitStatus = (BL_IS_REG_BIT_SET(tmpVal, AON_GPADC_NEG_SATUR)) ? SET : RESET;
            break;

        case ADC_INT_FIFO_UNDERRUN:
            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            bitStatus = (BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_FIFO_UNDERRUN)) ? SET : RESET;
            break;

        case ADC_INT_FIFO_OVERRUN:
            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            bitStatus = (BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_FIFO_OVERRUN)) ? SET : RESET;
            break;

        case ADC_INT_ADC_READY:
            tmpVal = BL_RD_REG(GPIP_BASE, GPIP_GPADC_CONFIG);
            bitStatus = (BL_IS_REG_BIT_SET(tmpVal, GPIP_GPADC_RDY)) ? SET : RESET;
            break;

        case ADC_INT_ALL:
            break;

        default:
            break;
    }

    return bitStatus;
}

/****************************************************************************/ /**
 * @brief  ADC install interrupt callback
 *
 * @param  intType: ADC interrupt type
 * @param  cbFun: ADC interrupt callback
 *
 * @return None
 *
*******************************************************************************/
void ADC_Int_Callback_Install(ADC_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_GPIP_ADC_INT_TYPE(intType));

