RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_adc.c
    if (BL_IS_REG_BIT_SET(tmpVal2, AON_GPADC_PGA_EN) && adc_mic_config->micPgaEn == ENABLE) {
        /* 0x4000F914[13] and 0x4000F90c[15] Cannot be both Enable*/
        return ERROR;
    } else {
        tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, AON_GPADC_MICPGA_EN, adc_mic_config->micPgaEn);
    }

    tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, AON_GPADC_MICBIAS_EN, adc_mic_config->micBiasEn);

    BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, tmpVal1);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  ADC MIC bias control
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void ADC_MIC_Bias_Enable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
    tmpVal = BL_SET_REG_BIT(tmpVal, AON_GPADC_MICBIAS_EN);
    BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, tmpVal);
}

/****************************************************************************/ /**
 * @brief  ADC MIC bias control
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void ADC_MIC_Bias_Disable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(AON_BASE, AON_GPADC_REG_CMD);
    tmpVal = BL_CLR_REG_BIT(tmpVal, AON_GPADC_MICBIAS_EN);
    BL_WR_REG(AON_BASE, AON_GPADC_REG_CMD, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Trim ADC Gain
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_CLOCK_SECTION ADC_Gain_Trim(void)
{
    Efuse_ADC_Gain_Coeff_Type trim;
    uint32_t tmp;

    EF_Ctrl_Read_ADC_Gain_Trim(&trim);

    if (trim.adcGainCoeffEn) {
        if (trim.adcGainCoeffParity == EF_Ctrl_Get_Trim_Parity(trim.adcGainCoeff, 12)) {
            adcGainCoeffCal.adcGainCoeffEnable = ENABLE;
            adcGainCoeffCal.adcgainCoeffVal = trim.adcGainCoeff;
            tmp = adcGainCoeffCal.adcgainCoeffVal;

            if (tmp & 0x800) {
                tmp = ~tmp;
                tmp += 1;
                tmp = tmp & 0xfff;
                //printf("val==%08x\r\n",(unsigned int)tmp);
                adcGainCoeffCal.coe = (1.0 + ((float)tmp / 2048.0));
                //printf("coe==%0f\r\n",adcGainCoeffCal.coe);
            } else {
                adcGainCoeffCal.coe = (1.0 - ((float)tmp / 2048.0));
                //printf("coe==%0f\r\n",adcGainCoeffCal.coe);
            }

            return SUCCESS;
        }
    }

    return ERROR;
}

/*@} end of group ADC_Public_Functions */

/*@} end of group ADC */

/*@} end of group BL808_Peripheral_Driver */
